.src/000/talk-and-check.org
#+TITLE: Talk and Check
#+STARTUP: showeverything


* 2020年8月4日，作业检查

- 李竞先  差一点点没写完，因为昨天晚上没时间。
- 黄茂茂  写完了，但是还有错误。
- 陈浪    还有一点马上写完
- 龚泽宇  没写完，还在写
- 李涛    没写完，报错
- 黄修林  没写完，因为懒。
- 刘海阳  懒。
- 曾铭扬  没写完，不会了
- 吴传龙  在敲案例，因为代码没学懂
- 王伟东  代码看不懂
- 林涛    不会
- 陈志明  昨晚再看复习资料，忘记了
- 莫世森  没写完，不太会写

* 2020年7月22日
** 第一组

- 黄罗心 :: 以前的案例代码没敲完，还没有轮到做作业的时间
- 刘永宏 :: 在看案例代码，上课的时候跟不上，作业没有做
- 李世泰 :: 在看案例代码，没来得及做作业，不会写代码、动手能力差

** 第二组

- 黄茂茂 :: 贪玩，不喜欢问别人问题，自制能力差，没投入时间在学习上
- 陈贤谋 :: 数据库连接都不知，说自己乱但是乱在哪里都说不清，作业一点没做

** 第三组

- 王俊豪 :: 自己说: 敲代码时很多错，JDBC 引入都没搞清楚。虽说写了代码，却没看到他写的任何代码
- 龚远东 :: 代码理解不全，所以进度慢，作业没做
- 刘海阳 :: 自疫情之后就跟不上，所以选择了自我放逐。代码有在敲，因为老师让敲就敲一点。没主动性。打算下学期再认真一点

** 第四组

- 莫世森 :: 平时犯困，精神不佳，晚上睡不好。所以上课睡觉，下课刷抖音。理解慢，作业没做
- 龚泽宇 :: 英语不好，所以对代码没兴趣。打算后期转 UI 设计，平时也有准备

** 第五组

- 李涛 :: 去年想退学，父母不同意，对学习不感兴趣。来学校的初衷是学设计，但现在一直没有任何自学的打算
- 邱志鹏 :: 1) 概念模糊 2) 代码不够熟练 3) 上课注意力集中时间短
- 吕劲 :: 1) 代码不太熟，写的时候会出现很多错误 2) 上课的时候容易走神

** 第六组

- 林涛 :: 写代码很吃力，看屏幕都会头晕，感觉自己不适合。想转新媒体运营专业，已跟父母沟通
- 卢勇傧 :: 学习方法有问题！碰到不会的，不会（想）问别人，只想到网上搜；结果搜了很多，还是一点代码都写不出来
- 陈志明 :: 英语太差，学习吃力；疫情之后更是力不从心。想转专业，已跟父母协商


** 第七组

- 曾铭扬 :: 从第三节课开始有部分听不懂，于是自己到网上搜；结果不懂的还是不懂，后面的又落下
- 吴传龙 :: 从 html 的布局开始听不懂，Java 仅会输入输出。所以没信心了，没动力了，迷茫，想转 UI
- 罗嘉诚 :: 重装系统后数据库怎么都安装失败，心态崩，导致不愿学不愿做事。所以作业没做
- 王伟东 :: 听不懂，进度慢，信心差点

** 第八组

- 易炜欣 :: 听不懂、跟不上、敲了代码但是不怎么理解，作业也就不懂了
- 李竞先 :: 注意力不在学习上，代码敲了也不理解，上课时常走神。迷
- 黄修林 :: 懒

