html/0-163-notes/000/talk-and-check.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-12-27 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Talk and Check</title>
<meta name="generator" content="Org mode">
<meta name="author" content="悟饭">
<link rel='stylesheet' href='/html/asset/common.css?3344' />
<link rel='stylesheet' href='/yaoliuyao/html/asset/common.css?3344' />

</head>
<body>
<div id="content">
<header>
<h1 class="title">Talk and Check</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org95becf4">1. 2020年8月4日，作业检查</a></li>
<li><a href="#orgffec0fe">2. 2020年7月22日</a>
<ul>
<li><a href="#org9c02362">2.1. 第一组</a></li>
<li><a href="#orgae42c21">2.2. 第二组</a></li>
<li><a href="#orga30bfb8">2.3. 第三组</a></li>
<li><a href="#orgb1bdaa1">2.4. 第四组</a></li>
<li><a href="#orgba2b65f">2.5. 第五组</a></li>
<li><a href="#orgbdd3dd1">2.6. 第六组</a></li>
<li><a href="#orgad0787c">2.7. 第七组</a></li>
<li><a href="#org7ca2f1e">2.8. 第八组</a></li>
</ul>
</li>
</ul>
</div>
</nav>


<section id="outline-container-org95becf4" class="outline-2">
<h2 id="org95becf4"><span class="section-number-2">1.</span> 2020年8月4日，作业检查</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>李竞先  差一点点没写完，因为昨天晚上没时间。</li>
<li>黄茂茂  写完了，但是还有错误。</li>
<li>陈浪    还有一点马上写完</li>
<li>龚泽宇  没写完，还在写</li>
<li>李涛    没写完，报错</li>
<li>黄修林  没写完，因为懒。</li>
<li>刘海阳  懒。</li>
<li>曾铭扬  没写完，不会了</li>
<li>吴传龙  在敲案例，因为代码没学懂</li>
<li>王伟东  代码看不懂</li>
<li>林涛    不会</li>
<li>陈志明  昨晚再看复习资料，忘记了</li>
<li>莫世森  没写完，不太会写</li>
</ul>
</div>
</section>

<section id="outline-container-orgffec0fe" class="outline-2">
<h2 id="orgffec0fe"><span class="section-number-2">2.</span> 2020年7月22日</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org9c02362" class="outline-3">
<h3 id="org9c02362"><span class="section-number-3">2.1.</span> 第一组</h3>
<div class="outline-text-3" id="text-2-1">
<dl class="org-dl">
<dt>黄罗心</dt><dd>以前的案例代码没敲完，还没有轮到做作业的时间</dd>
<dt>刘永宏</dt><dd>在看案例代码，上课的时候跟不上，作业没有做</dd>
<dt>李世泰</dt><dd>在看案例代码，没来得及做作业，不会写代码、动手能力差</dd>
</dl>
</div>
</div>

<div id="outline-container-orgae42c21" class="outline-3">
<h3 id="orgae42c21"><span class="section-number-3">2.2.</span> 第二组</h3>
<div class="outline-text-3" id="text-2-2">
<dl class="org-dl">
<dt>黄茂茂</dt><dd>贪玩，不喜欢问别人问题，自制能力差，没投入时间在学习上</dd>
<dt>陈贤谋</dt><dd>数据库连接都不知，说自己乱但是乱在哪里都说不清，作业一点没做</dd>
</dl>
</div>
</div>

<div id="outline-container-orga30bfb8" class="outline-3">
<h3 id="orga30bfb8"><span class="section-number-3">2.3.</span> 第三组</h3>
<div class="outline-text-3" id="text-2-3">
<dl class="org-dl">
<dt>王俊豪</dt><dd>自己说: 敲代码时很多错，JDBC 引入都没搞清楚。虽说写了代码，却没看到他写的任何代码</dd>
<dt>龚远东</dt><dd>代码理解不全，所以进度慢，作业没做</dd>
<dt>刘海阳</dt><dd>自疫情之后就跟不上，所以选择了自我放逐。代码有在敲，因为老师让敲就敲一点。没主动性。打算下学期再认真一点</dd>
</dl>
</div>
</div>

<div id="outline-container-orgb1bdaa1" class="outline-3">
<h3 id="orgb1bdaa1"><span class="section-number-3">2.4.</span> 第四组</h3>
<div class="outline-text-3" id="text-2-4">
<dl class="org-dl">
<dt>莫世森</dt><dd>平时犯困，精神不佳，晚上睡不好。所以上课睡觉，下课刷抖音。理解慢，作业没做</dd>
<dt>龚泽宇</dt><dd>英语不好，所以对代码没兴趣。打算后期转 UI 设计，平时也有准备</dd>
</dl>
</div>
</div>

<div id="outline-container-orgba2b65f" class="outline-3">
<h3 id="orgba2b65f"><span class="section-number-3">2.5.</span> 第五组</h3>
<div class="outline-text-3" id="text-2-5">
<dl class="org-dl">
<dt>李涛</dt><dd>去年想退学，父母不同意，对学习不感兴趣。来学校的初衷是学设计，但现在一直没有任何自学的打算</dd>
<dt>邱志鹏</dt><dd>1) 概念模糊 2) 代码不够熟练 3) 上课注意力集中时间短</dd>
<dt>吕劲</dt><dd>1) 代码不太熟，写的时候会出现很多错误 2) 上课的时候容易走神</dd>
</dl>
</div>
</div>

<div id="outline-container-orgbdd3dd1" class="outline-3">
<h3 id="orgbdd3dd1"><span class="section-number-3">2.6.</span> 第六组</h3>
<div class="outline-text-3" id="text-2-6">
<dl class="org-dl">
<dt>林涛</dt><dd>写代码很吃力，看屏幕都会头晕，感觉自己不适合。想转新媒体运营专业，已跟父母沟通</dd>
<dt>卢勇傧</dt><dd>学习方法有问题！碰到不会的，不会（想）问别人，只想到网上搜；结果搜了很多，还是一点代码都写不出来</dd>
<dt>陈志明</dt><dd>英语太差，学习吃力；疫情之后更是力不从心。想转专业，已跟父母协商</dd>
</dl>
</div>
</div>


<div id="outline-container-orgad0787c" class="outline-3">
<h3 id="orgad0787c"><span class="section-number-3">2.7.</span> 第七组</h3>
<div class="outline-text-3" id="text-2-7">
<dl class="org-dl">
<dt>曾铭扬</dt><dd>从第三节课开始有部分听不懂，于是自己到网上搜；结果不懂的还是不懂，后面的又落下</dd>
<dt>吴传龙</dt><dd>从 html 的布局开始听不懂，Java 仅会输入输出。所以没信心了，没动力了，迷茫，想转 UI</dd>
<dt>罗嘉诚</dt><dd>重装系统后数据库怎么都安装失败，心态崩，导致不愿学不愿做事。所以作业没做</dd>
<dt>王伟东</dt><dd>听不懂，进度慢，信心差点</dd>
</dl>
</div>
</div>

<div id="outline-container-org7ca2f1e" class="outline-3">
<h3 id="org7ca2f1e"><span class="section-number-3">2.8.</span> 第八组</h3>
<div class="outline-text-3" id="text-2-8">
<dl class="org-dl">
<dt>易炜欣</dt><dd>听不懂、跟不上、敲了代码但是不怎么理解，作业也就不懂了</dd>
<dt>李竞先</dt><dd>注意力不在学习上，代码敲了也不理解，上课时常走神。迷</dd>
<dt>黄修林</dt><dd>懒</dd>
</dl>
</div>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: 悟饭</p>
<p class="date">Created: 2021-12-27</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
